var
 i,p:integer;
 f:text;
begin
 assign(f, 'D:\Колледж\Основы аллгоритм и программирования\LR-13\1.txt'); {обеспечивает связь файловой переменной программы с реальным файлом на диске. Первым аргументом указывается переменная, вторым – адресное имя файла.}
 rewrite(f);{Rewrite перед открытием файла пересоздаёт его (удаляет, если он был создан ранее, и создаёт снова)}
 i:=0;
 writeln('Введите 10 чисел: ');
  while i<10 do
   begin
    inc(i);
    readln(p);
    writeln(f,p);
   end;
 close(f); {закрытие файла}
end.