var
 f,g:text;{ Дано целое число K и текстовый файл. В данном файле вставить пустую строку перед строкой с номером K. Если строки с таким номером нет, то оставить файл без изменений.
Для решения задачи можно использовать дополнительный временный файл.}
 k,i:integer;
 s:string;
begin
 readln(k);
 inc(k);
 assign(f,'D:\Колледж\Основы аллгоритм и программирования\LR-13\4.txt'); {обеспечивает связь файловой переменной программы с реальным файлом на диске. Первым аргументом указывается переменная, вторым – адресное имя файла.}
 reset(f);{Reset - открытие существующего файла}
 assign(g,'D:\Колледж\Основы аллгоритм и программирования\LR-13\5.txt');
 rewrite(g);{Rewrite перед открытием файла пересоздаёт его (удаляет, если он был создан ранее, и создаёт снова)}{процедура открытия создаваемого файла для записи в него информации; если файл с таким именем уже существует, то информация в нем стирается:}
 while not eof(f) do {цикл бужет прожолжатся до конца файла}
  begin
   readln(f,s);
   inc(i);
   if i=k then writeln(g);
   writeln(g,s);
  end;
 close(f);close(g);
 deletefile('D:\Колледж\Основы аллгоритм и программирования\LR-13\4.txt');
renamefile('D:\Колледж\Основы аллгоритм и программирования\LR-13\5.txt','D:\Колледж\Основы аллгоритм и программирования\LR-13\4.txt');
end.